-- 1.担当者(sales)表から、担当者番号(sno)が106である担当者の情報を表示する。
NULL;

-- 2.商品(com)表から、商品名(cname)が'JACKET'である商品の、商品番号(cno)、商品名(cname)、および単価(prc)を表示する。
NULL;

-- 3.注文表(ord)表から、受注日(odate)が'05-04-14'の注文データについて、受注番号(ono)、商品番号(cno)、および販売価格(prc)を表示する。
NULL;

-- 4.注文(ord)表から、受注日(odate)が'05-04-19'以降の注文データについて、受注番号(ono)、商品番号(cno)、および受注日(odate)を表示する。
NULL;

-- 5.商品(com)表から、単価(prc)が\5,000～\10,000である商品の、商品番号(cno)、商品名(cname)、および単価(prc)を表示する。
NULL;

-- 6.注文(ord)表から、受注日(odate)が'05-04-15'から'05-04-18'の注文データについて、受注番号(ono)、商品番号(cno)、および受注日(odate)を表示する。
NULL;

-- 7.商品(com)表から、商品名(cname)が'PARKA'から'SNEAKERS'までの商品について、商品名(cname)、および単価(prc)を表示する。
NULL;

-- 8.商品(com)表から、商品名(cname)が'SKIRT'、'SOCKS_MEN'、または'WALLET'である商品の、商品番号(cno)、商品名(cname)、および単価(prc)を表示する。
NULL;

-- 9.担当者(sales)表から、担当者番号(sno)が101,103,または105の担当者について、担当者番号(sno)、担当者名(sname)、および配属日(edate)を表示する。
NULL;

-- 10.従業員(sales)表から、担当者名(sname)の2文字目が「A」で最後が「O」で終わる担当者名を表示する。
NULL;

-- 11.従業員(sales)表から、売上金額(amt)がNULL値である担当者名(sname)を表示する。
NULL;

-- 12.商品(com)表から、単価(prc)が5000以上で、商品名(cname)が「MEN」で終わる商品の、商品名(cname)、単価(prc)、および担当者番号(sno)を表示する。
NULL;

-- 13.従業員(sales)表から、従業員名(sname)が「SA」または「KA」で始まり、売上金額(amt)が\300,000以上の従業員名(sname) を表示する。
NULL;

-- 14.商品(com)表から、担当者番号(sno)が101,103,105以外の商品について、商品名(cname)、単価(prc)、および担当者番号(sno)を表示する。
NULL;

-- 15.担当者(sales)表から、担当者名(sname)が「K」または「T」以外で始まり、上司(MGR)がNULLでない担当者の、担当者名(sname)および上司(mgr)を表示する。
NULL;

-- 16.担当者(sales)表から、売上金額(amt)の少ない順に、担当者名(sname)、および売上金額(amt)を表示する。
NULL;

-- 17.担当者(sales)表から、担当者番号(sno)、担当者名(sname)、および売上金額(amt)の12倍(列別名：amount)を、売上金額の12倍の降順にソートして表示する。
NULL;

-- 18.担当者(sales)表から、部門番号(dno)が12の、担当者名(sname)および売上金額(amt)を、配属日(edate)順に表示する。
NULL;

-- 19.担当者(sales)表から、売上金額が\200,000以上の担当者の、担当者番号(sno)、担当者名(sname)、部門番号(dno)、および売上金額(amt)を、部門番号(dno)の昇順に表示する。なお、同じ部門番号のデータについては、売上金額(amt)の降順に表示する。
NULL;
